{
  "irVersion": "1.0",
  "project": "omnistorage-core",
  "repository": "https://github.com/plexusone/omnistorage-core",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-04-25",
      "highlights": [
        { "description": "Organization change: module renamed from github.com/grokify/omnistorage to github.com/plexusone/omnistorage-core with reorganized package structure" }
      ],
      "breaking": [
        { "description": "Module renamed from `github.com/grokify/omnistorage` to `github.com/plexusone/omnistorage-core`", "commit": "85b2b62" },
        { "description": "Package structure reorganized: `backend/` → `object/backend/`, `compress/` → `object/compress/`, `format/` → `object/format/`, `sync/` → `object/sync/`", "commit": "85b2b62" },
        { "description": "S3 backend removed from core; now available in separate [`plexusone/omni-aws`](https://github.com/plexusone/omni-aws) package", "commit": "85b2b62" },
        { "description": "AWS SDK dependencies removed to keep core thin and provider-agnostic", "commit": "85b2b62" }
      ],
      "added": [
        { "description": "New `kvs/` subsystem for key-value storage with `Store`, `ListableStore`, and `DocumentStore` interfaces", "commit": "85b2b62" },
        { "description": "In-memory KVS backend (`kvs/backend/memory`) for ephemeral storage", "commit": "85b2b62" },
        { "description": "SQLite KVS backend (`kvs/backend/sqlite`) for persistent key-value storage using `modernc.org/sqlite`", "commit": "85b2b62" }
      ],
      "changed": [
        { "description": "MkDocs theme updated to PlexusOne design system with dark mode default", "commit": "2a499af" },
        { "description": "Site URL updated to `plexusone.github.io/omnistorage-core`", "commit": "2a499af" }
      ],
      "documentation": [
        { "description": "All documentation updated for new module name and package paths", "commit": "a0114c1" },
        { "description": "S3 backend documentation updated to reference `plexusone/omni-aws` package", "commit": "a0114c1" },
        { "description": "README badges and links updated for new organization", "commit": "3cf603d" }
      ],
      "dependencies": [
        { "description": "Add `modernc.org/sqlite` v1.49.1 for SQLite KVS backend", "commit": "85b2b62" },
        { "description": "Remove AWS SDK v2 dependencies (moved to omni-aws)", "commit": "85b2b62" },
        { "description": "Bump `github.com/grokify/mogo` from 0.74.0 to 0.74.2", "commit": "07a9cf5" },
        { "description": "Bump `golang.org/x/crypto` from 0.49.0 to 0.50.0", "commit": "80c7c47" },
        { "description": "Bump `github.com/klauspost/compress` from 1.18.4 to 1.18.5", "commit": "05a4c52" }
      ],
      "ci": [
        { "description": "Update shared CI/CD pipelines to 0.3.0", "commit": "c261d5a" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Security fix for SFTP host key verification, cross-platform timestamp improvements, and dependency updates" }
      ],
      "security": [
        { "description": "SFTP backend now verifies host keys using `~/.ssh/known_hosts` instead of `InsecureIgnoreHostKey()` to prevent MITM attacks", "commit": "8bf114c" }
      ],
      "changed": [
        { "description": "SFTP backend requires server host key in `~/.ssh/known_hosts` file for connections", "commit": "8bf114c" },
        { "description": "Use `oscompat/tsync` for cross-platform timestamp comparison in `sync.NeedsUpdate()`", "commit": "75bb613" }
      ],
      "dependencies": [
        { "description": "Add `github.com/grokify/oscompat` v0.1.0 dependency", "commit": "75bb613" },
        { "description": "Bump `github.com/klauspost/compress` from 1.18.2 to 1.18.3", "commit": "1c2da6e" },
        { "description": "Bump `golang.org/x/crypto` from 0.46.0 to 0.47.0", "commit": "bcc14ea" },
        { "description": "Bump `github.com/grokify/mogo` from 0.72.5 to 0.72.6", "commit": "bd348b1" }
      ],
      "documentation": [
        { "description": "Rename Omnistorage to OmniStorage in documentation", "commit": "190488c" },
        { "description": "Fix TRD.md formatting", "commit": "c38909e" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-10",
      "highlights": [
        { "description": "Initial release with unified storage abstraction layer for Go" }
      ],
      "added": [
        { "description": "Core `Backend` interface with `NewWriter`, `NewReader`, `Exists`, `Delete`, `List`, `Close` methods", "commit": "0ae32d4" },
        { "description": "`RecordWriter` and `RecordReader` interfaces for streaming record-oriented data", "commit": "0ae32d4" },
        { "description": "`ExtendedBackend` interface with `Stat`, `Mkdir`, `Rmdir`, `Copy`, `Move`, and `Features` methods", "commit": "0ae32d4" },
        { "description": "`ObjectInfo` interface for file metadata (Size, ModTime, Hash, MimeType)", "commit": "0ae32d4" },
        { "description": "Hash support for MD5, SHA1, SHA256, CRC32, and custom hash types", "commit": "0ae32d4" },
        { "description": "Features struct for backend capability discovery", "commit": "0ae32d4" },
        { "description": "Backend registry with `Register()`, `Open()`, and `Backends()` functions", "commit": "0ae32d4" },
        { "description": "File backend (`backend/file`) for local filesystem storage", "commit": "0e30186" },
        { "description": "Memory backend (`backend/memory`) for in-memory storage and testing", "commit": "0e30186" },
        { "description": "S3 backend (`backend/s3`) supporting AWS S3, Cloudflare R2, MinIO, Wasabi, and other S3-compatible services", "commit": "5d3aa2f" },
        { "description": "SFTP backend (`backend/sftp`) for SSH file transfer with password and key authentication", "commit": "a17e985" },
        { "description": "Channel backend (`backend/channel`) for Go channel-based inter-goroutine communication", "commit": "41109e3" },
        { "description": "Multi-writer (`multi/writer`) for fan-out to multiple backends (WriteAll, WriteBestEffort, WriteQuorum modes)", "commit": "18e84fd" },
        { "description": "NDJSON format (`format/ndjson`) for newline-delimited JSON record framing", "commit": "9ec3bd3" },
        { "description": "Gzip compression (`compress/gzip`) wrapper", "commit": "60a6395" },
        { "description": "Zstandard compression (`compress/zstd`) wrapper", "commit": "60a6395" },
        { "description": "Sync package with rclone-inspired file synchronization", "commit": "a66ded4" },
        { "description": "`sync.Sync()` for one-way sync with optional delete", "commit": "a66ded4" },
        { "description": "`sync.Copy()` for copying files without deleting extras", "commit": "a66ded4" },
        { "description": "`sync.CopyFile()`, `sync.CopyBetweenPaths()`, `sync.CopyToPath()`, `sync.CopyFromPath()` convenience functions", "commit": "a66ded4" },
        { "description": "`sync.TreeCopy()` for preserving full directory structure", "commit": "a66ded4" },
        { "description": "`sync.Check()` for comparing files between backends", "commit": "a66ded4" },
        { "description": "`sync.Verify()`, `sync.VerifyFile()`, `sync.VerifyChecksum()` for verification", "commit": "a66ded4" },
        { "description": "`sync.VerifyWithDetails()` and `sync.VerifyAndReport()` for detailed verification results", "commit": "a66ded4" },
        { "description": "`sync.VerifyIntegrity()` and `sync.VerifyAllIntegrity()` for file integrity checks", "commit": "a66ded4" },
        { "description": "`sync.Bisync()` for bidirectional sync with conflict resolution (NewerWins, LargerWins, KeepBoth, etc.)", "commit": "a66ded4" },
        { "description": "Filter system (`sync/filter`) with include/exclude patterns, size filters, and age filters", "commit": "a66ded4" },
        { "description": "Rate limiting with token bucket algorithm for bandwidth control", "commit": "a66ded4" },
        { "description": "Retry with exponential backoff and jitter for failed operations", "commit": "a66ded4" },
        { "description": "Progress callbacks for sync operations", "commit": "a66ded4" },
        { "description": "Dry-run mode for sync operations", "commit": "a66ded4" },
        { "description": "Concurrent transfer support with configurable parallelism", "commit": "a66ded4" },
        { "description": "Structured logging via slog for sync operations", "commit": "a66ded4" },
        { "description": "Helper functions `CopyPath()` and `MovePath()` for cross-backend operations", "commit": "0ae32d4" },
        { "description": "`AsExtended()` helper for type-safe ExtendedBackend conversion", "commit": "0ae32d4" }
      ],
      "documentation": [
        { "description": "README.md with usage examples and API documentation", "commit": "c311de1" },
        { "description": "ROADMAP.md with development phases and planned features", "commit": "c311de1" },
        { "description": "PRD.md (Product Requirements Document)", "commit": "c311de1" },
        { "description": "TRD.md (Technical Requirements Document)", "commit": "c311de1" },
        { "description": "GoDoc comments on all public APIs", "commit": "c311de1" }
      ],
      "tests": [
        { "description": "Comprehensive test suite with 80+ tests across all packages", "commit": "de720c3" },
        { "description": "Conformance tests for backend implementations", "commit": "de720c3" },
        { "description": "Integration tests for file, memory, and S3 backends", "commit": "de720c3" }
      ]
    }
  ]
}
